tutorials/uweBourdonBoringReference/uweBourdonBoringReference/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    
    {
        name    survivingCells;
        type    cellSet;
        action  new;
        source  fieldToCell;
        sourceInfo
        {
        field		materials;
	min 0.5;
	max 1.5;


    	}
    }

);





// ************************************************************************* //